Tests/LadenburgJet60psi/Ladenburg-very-coarse-m3/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 247.1;
    }
    
    "(outlet|freestream)"
    {
        type            inletOutlet
        value           uniform 297;
        inletValue      uniform 297;
    }
    
    freestreamInlet
    {
        type            zeroGradient;
    }
    
    wedge1 {type wedge;}
    wedge2 {type wedge;}
}

// ************************************************************************* //
